app/views/partials/_category.html.erb

<div>
  <strong>$<%= category.expenses.sum(:amount) %> </strong>
---
SELECT SUM("expenses"."amount") FROM "expenses" INNER JOIN "expense_categories" ON "expenses"."id" = "expense_categories"."expense_id" WHERE "expense_categories"."category_id" = $1  [["category_id", 14]]