app/controllers/categories_controller.rb

  def index
    @categories = Category.includes(:author).all
---
SELECT "categories".* FROM "categories"

  def show
    @user = current_user

    @category = @user.categories.includes(:author, :expenses).find(params[:id])
---
SELECT "categories".* FROM "categories" WHERE "categories"."author_id" = $1 AND "categories"."id" = $2 LIMIT $3  [["author_id", 5], ["id", 14], ["LIMIT", 1]]
SELECT "expenses".* FROM "expenses" WHERE "expenses"."id" IN ($1, $2)  [["id", 16], ["id", 18]]

  def create
    @user = current_user
    @category = @user.categories.build(category_param)

    if @category.save
---
INSERT INTO "categories" ("name", "icon", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def destroy
    @category = current_user.categories.find(params[:id])

    if @category.destroy
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]
DELETE FROM "categories" WHERE "categories"."id" = $1  [["id", 14]]