app/controllers/expenses_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "expenses" ("name", "amount", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "lunch"], ["amount", "12.0"], ["author_id", 1], ["created_at", "2023-07-29 14:51:49.233380"], ["updated_at", "2023-07-29 14:51:49.233380"]]
INSERT INTO "expenses" ("name", "amount", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "tx1"], ["amount", "12.0"], ["author_id", 1], ["created_at", "2023-07-27 17:17:16.552233"], ["updated_at", "2023-07-27 17:17:16.552233"]]
---
  def create
    @expense = Expense.new(name: expense_params[:name], amount: expense_params[:amount])
    @expense.author = current_user
    @category = Category.find(expense_params[:category_id])

    #@category.id = expense_params[:category_id]

    if @expense.save
      @category.expenses << @expense

SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "expenses".* FROM "expenses" INNER JOIN "expense_categories" ON "expenses"."id" = "expense_categories"."expense_id" WHERE "expense_categories"."category_id" = $1 AND "expenses"."id" = $2 LIMIT $3  [["category_id", 1], ["id", 11], ["LIMIT", 1]]
DELETE FROM "expense_categories" WHERE "expense_categories"."expense_id" = $1  [["expense_id", 11]]
DELETE FROM "expenses" WHERE "expenses"."id" = $1  [["id", 11]]
---
  def destroy
    @category = Category.includes(:author).find(params[:category_id])
    @expense = @category.expenses.find(params[:id])
    if @expense.destroy

SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_category
    @category = Category.includes(:author).find(params[:category_id])