app/views/categories/show.html.erb

SELECT "expenses".* FROM "expenses" INNER JOIN "expense_categories" ON "expenses"."id" = "expense_categories"."expense_id" WHERE "expense_categories"."category_id" = $1 ORDER BY "expenses"."created_at" DESC  [["category_id", 14]]
SELECT SUM("expenses"."amount") FROM "expenses" INNER JOIN "expense_categories" ON "expenses"."id" = "expense_categories"."expense_id" WHERE "expense_categories"."category_id" = $1  [["category_id", 14]]
---
    <div><%= @category.name %></div>
    <div><%= @category.expenses.sum(:amount) %></div>

SELECT "expenses".* FROM "expenses" INNER JOIN "expense_categories" ON "expenses"."id" = "expense_categories"."expense_id" WHERE "expense_categories"."category_id" = $1 ORDER BY "expenses"."created_at" DESC  [["category_id", 14]]
---
  <ul class='page_body'>
  <% @category.expenses.order(created_at: :desc).each do |expense| %>