app/views/expenses/new.html.erb

    <%= f.label :category_id %>
    <%= f.select :category_id, current_user.categories.all.map { |category| [category.name, category.id] }, {}, class:'category_select' %>
---
SELECT "categories".* FROM "categories"